[errorMsg]

PCT_ERR_FAIL="Erreur inconnue"

PCT_ERR_INVALUD_PARS="Paramètre invalide"

PCT_ERR_NOT_SURPPORT="Ne supporte pas"

PCT_ERR_OPEN_FILE_FAIL="Impossible d'ouvrir le fichier"

PCT_ERR_NO_MEMORY="Mémoire insuffisante"

PCT_ERR_READ_FILE="Impossible de lire le fichier."

PCT_ERR_FILE_FORMAT="Erreur de format de fichier"

PCT_ERR_NOMORE_ITEM="Il n'y a pas d'autres fichiers"

PCT_ERR_FILE_PROCESS="Echouer à traiter le fichier"

PCT_ERR_MEMORY_FAIL="Erreur de mémoire"

PCT_ERR_WRITE_FILE="Echouer à écrire le fichier"

PCT_ERR_USER_CANCEL="Annulé par utilisateur"

PCT_ERR_NOT_INIT_FUN="Non initialisé"

PCT_ERR_CREATE_THREAD="Echouer à créer le fil"

PCT_ERR_DEVICE_NO_MORE_SPACE="Espace disque insuffisant"

PCT_ERR_DEVICE_FAIL="Erreur de disque"

PCT_ERR_PATH_INVALID="Chemin invalide"

PCT_ERR_CALL_API="Echouer à appeler"

PCT_ERR_FILE_NOT_EXIST="Le fichier n'existe pas"

PCT_ERR_FILE_IN_USING="Le fichier est utilisé par un autre processus."

PCT_ERR_REG_FAIL="Erreur de registre"

PCT_ERR_NET_CONN="Le réseau n'est pas   connecté ou est déconnecté"

PCT_ERR_LICENSE_OUTDATA="Licence a expiré"

PCT_ERR_NOT_SAME_VERSION="Les versions sont incompatibles."

PCT_ERR_NO_DISKSPACE="Espace disque insuffisant."

PCT_ERR_NTFS_MUST="Echouer à transférer les applications parce qu'elles ne sont pas installées sur le système de fichiers NTFS."

PCT_ERR_INSTALL_APPX_FAILED="ces applications sont incompatible avec le PC cible. Réinstallation requise"

PCT_ERR_MOVE_APPX_FAILED="L'application est incompatible avec le système de fichier de la partition cible"

